# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [ ]:
url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
baby_names = pd.read_csv(url)

### Step 4. See the first 10 entries

In [ ]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [ ]:
baby_names.drop(["Unnamed: 0", "Id"], axis = 1, inplace = True)

In [ ]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [ ]:
baby_names["Gender"].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [ ]:
names = baby_names.groupby("Name")

### Step 8. How many different names exist in the dataset?

In [ ]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [ ]:
names.sum()["Count"].sort_values(ascending=False).head(1)

Name
Jacob    242874
Name: Count, dtype: int64

### Step 10. How many different names have the least occurrences?

In [ ]:
(baby_names.Name.value_counts() == baby_names.Name.value_counts().min()).sum()

3682

### Step 11. What is the median name occurrence?

In [ ]:
names.median()

           Year  Count
Name
Aaban    2013.5    6.0
Aadan    2008.5    5.5
Aadarsh  2009.0    5.0
Aaden    2010.0   10.0
Aadhav   2014.0    6.0
...         ...    ...
Zyra     2013.0    6.0
Zyrah    2012.0    5.5
Zyren    2013.0    6.0
Zyria    2008.0    6.0
Zyriah   2009.0    6.0

[17632 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [ ]:
names.std()

             Year      Count
Name
Aaban    0.707107   0.000000
Aadan    2.872281   0.957427
Aadarsh       NaN        NaN
Aaden    2.044322  21.154974
Aadhav        NaN        NaN
...           ...        ...
Zyra     2.115701   1.154701
Zyrah    1.414214   0.707107
Zyren         NaN        NaN
Zyria    2.685351   0.737865
Zyriah   2.915476   1.666667

[17632 rows x 2 columns]

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [ ]:
baby_names.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,1016395.0,2009.053190,3.138293,2004.0,2006.0,2009.0,2012.0,2014.0
Count,1016395.0,34.850124,97.397346,5.0,7.0,11.0,26.0,4167.0